# GetDockablePane Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIControlledApplication..::..GetDockablePane Method
UIControlledApplication Class See Also
---
Gets a DockablePane object by its ID.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public DockablePane GetDockablePane(
	DockablePaneId id
)
```

Visual Basic
---
```text
Public Function GetDockablePane ( _
	id As DockablePaneId _
) As DockablePane
```

Visual C++
---
```text
public:
DockablePane^ GetDockablePane(
	DockablePaneId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.UI..::..DockablePaneIdUnique identifier for the new pane.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if no dockable pane has been registered with identifier %id%. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the dockable pane with identifier %id% has not been created yet. |

# See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace